<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<HTML
><HEAD
><TITLE
>Dispositivos de interconexión</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.79"><LINK
REL="HOME"
TITLE="La distribución Aprendiendo de Jesús como servidor y cortafuegos"
HREF="book1.htm"><LINK
REL="PREVIOUS"
TITLE="Lecturas recomendadas"
HREF="x327.htm"><LINK
REL="NEXT"
TITLE="Conexión a Internet con un módem o módem ISDN"
HREF="x486.htm"></HEAD
><BODY
CLASS="chapter"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>La distribución Aprendiendo de Jesús como servidor y cortafuegos</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="x327.htm"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="x486.htm"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="chapter"
><H1
><A
NAME="dispositivos-interconexion"
></A
>Capítulo 3. Dispositivos de interconexión</H1
><DIV
CLASS="TOC"
><DL
><DT
><B
>Tabla de contenidos</B
></DT
><DT
><A
HREF="c354.htm#modem-nulo"
>Conexión con un módem nulo</A
></DT
><DT
><A
HREF="x486.htm"
>Conexión a Internet con un módem o módem ISDN</A
></DT
><DT
><A
HREF="x503.htm"
>Conexión a Internet ADSL con pppoe</A
></DT
><DT
><A
HREF="x531.htm"
>Uso y configuración en una red LAN Ethernet</A
></DT
><DT
><A
HREF="x768.htm"
>Red Local Inalámbrica: uso y configuración</A
></DT
></DL
></DIV
><P
>Durante el arranque, OpenBSD detecta la gran mayoría de 
      dispositivos conectados a un computador.  Una vez en operación
      puede examinar la detección con <TT
CLASS="literal"
>dmesg</TT
>.  
    </P
><P
>Si durante el arranque algún dispositivo no es detectado
      o es detectado incorrectamente, puede intentar hacer modificaciones
      durante el arranque iniciando con <TT
CLASS="literal"
>bsd -c</TT
> cuando
      esté en el prompt de arranque del programa <B
CLASS="command"
>boot</B
>
      (ver [<SPAN
CLASS="citation"
>usuario_OpenBSD</SPAN
>]).
    </P
><DIV
CLASS="sect1"
><H1
CLASS="sect1"
><A
NAME="modem-nulo"
>Conexión con un módem nulo</A
></H1
><P
> Para conectar una terminal a un sistema OpenBSD puede emplearse
    un módem nulo.  La terminal puede ser un computador con OpenBSD o con
    cualquier otro sistema operativo y un programa que permita ver la
    información que llegue a un puerto serial y enviar la que se teclee
    (por ejemplo sirven varios programas para comunicarse vía módem).
  </P
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="modem-nulo-hardware"
>Módem Nulo</A
></H2
><P
>&#13;	    Un módem nulo es un cable serial que tiene en sus extremos dos 
	    conectores hembra para puerto serial y que intercambia algunas 
	    conexiones. Si ambos conectores son de 25 pines, todos los cables 
	    deben estar sueltos excepto: 
      <P
></P
><UL
><LI
><P
>(DSR) 6 &#38; (DCD) 8 -- 20,</P
></LI
><LI
><P
>(TxD) 2 -- 3,</P
></LI
><LI
><P
>(RxD) 3 -- 2, </P
></LI
><LI
><P
>(RTS) 4 -- 5,</P
></LI
><LI
><P
>(CTS) 5 -- 4,</P
></LI
><LI
><P
>(SG) 7 -- 7, </P
></LI
><LI
><P
>(DTR) 20 -- 6 &#38; 8.</P
></LI
></UL
>  

      En un conector de 9 pines la nomenclatura es: 
      1 DCD, 2 TxD, 3 RxD, 4 DTR, 5 SG, 6 DSR, 7 RTS y 8 CTS. 
    </P
><P
>Un módem nulo mínimo sólo requiere que se conecten SG - SG
      (tierra), TxD - RxD (transmisión de uno con recepción del
      otro) y RxD - TxD.  Sin embargo para poder efectuar control
      de flujo también deben conectarse los demás.
    </P
><P
>Aunque en el comercio es posible comprar un módem nulo, también es
      relativamente fácil ensamblar uno, una vez tenga conectores,  
      cable y cautín.  Si hace su propio módem nulo puede probar 
      que la conexión haya quedado bien empleando un ohmiometro.
    </P
><P
>&#13;      Una vez se conecte un módem nulo puede probarlo enviando mensajes
      por el puerto serial del uno y viendo lo que recibe en el otro. 
      Por ejemplo si conecta dos sistemas OpenBSD empleando en ambos
      el primer puerto serial, en uno de los dos puede ejecutar 
      (como usuario <TT
CLASS="literal"
>root</TT
>)
      <PRE
CLASS="screen"
>&#13;	cat &#60; /dev/cua00</PRE
>
      mientras que en el otro ejecute
      <PRE
CLASS="screen"
>&#13;	cat &#62; /dev/cua00</PRE
>
      cuando escriba en el segundo y presione ENTER, en el primero recibirá
      el mensaje y líneas en blanco (<TT
CLASS="literal"
>cat</TT
> no es el
      programa apropiado para establecer la comunicación, sólo para probar).
    </P
></DIV
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="servidor"
>Servidor</A
></H2
><P
>Con un módem nulo conectado y funcionado puede configurarse
      un sistema OpenBSD como servidor para que permita conectar 
      terminales a un puerto serial.  Debe configurarse el 
      programa <B
CLASS="command"
>init</B
> para que durante el arranque ejecute un
      programa que reciba conexiones por el puerto serial (tal programa
      normalmente es <TT
CLASS="filename"
>getty</TT
>).
    </P
><P
>&#13;      Basta editar el archivo <TT
CLASS="filename"
>/etc/ttys</TT
>, quitar el 
      comentario a la línea apropiada para que quede:
      <PRE
CLASS="screen"
>&#13;tty00   "/usr/libexec/getty std.9600"   vt220 on secure
      </PRE
>
      Después puede reiniciar el sistema o reiniciar <B
CLASS="command"
>init</B
>
      con: <B
CLASS="command"
>kill -HUP 1</B
>.
    </P
><P
>&#13;      En la línea modificada a <TT
CLASS="filename"
>/etc/ttys</TT
>,
      <TT
CLASS="literal"
>tty00</TT
> se refiere a
      <TT
CLASS="filename"
>/dev/tty00</TT
> (i.e el dispositivo
      del primer puerto serial); <TT
CLASS="literal"
>/usr/libexec/getty std.9600</TT
>
      es el comando por ejecutar al arranque para manejar ese 
      dispositivo<A
NAME="AEN405"
HREF="#FTN.AEN405"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
>;
      <TT
CLASS="literal"
>vt220</TT
> indica el tipo de terminal que se conectará;
      <B
CLASS="command"
>on</B
> y <B
CLASS="command"
>secure</B
> son 
      banderas<A
NAME="AEN413"
HREF="#FTN.AEN413"
><SPAN
CLASS="footnote"
>[2]</SPAN
></A
> para
      <B
CLASS="command"
>init</B
>, el primero indica que se esperan conexiones por
      esa línea tty y el segundo indica que puede iniciar conexiones el
      usuario root.
    </P
></DIV
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="Terminal"
>Terminal</A
></H2
><P
>Una vez conectado su módem nulo a un servidor
      OpenBSD ya configurado para recibir conexiones por el puerto
      serial, puede conectar una terminal.</P
><P
>Si la terminal cuenta con un sistema operativo, puede emplear 
      un programa de comunicaciones.  Con este debe poder ver los mensajes 
      de login del servidor.
      Desde ahí puede entrar como un usuario de ese sistema y trabajar
      como en una de las consolas virtuales (sin ambiente X).
    </P
><P
>Si el computador que va a conectar es un sistema OpenBSD puede
      emplear el programa <B
CLASS="command"
>tip</B
> como usuario root:
      <PRE
CLASS="screen"
>&#13;tip tty0 </PRE
>
      Es posible que tenga que intentar varias veces, si configura el
      servidor con una velocidad diferente puede especificarla por ejemplo
      con <B
CLASS="command"
>tip -38400 tty0</B
>
    </P
><P
>&#13;      <B
CLASS="command"
>tip</B
> empleará la descripción de <TT
CLASS="literal"
>tty0</TT
>
      disponible en <TT
CLASS="filename"
>/etc/remote</TT
> (que por defecto
      está configurado para representar el primer puerto serial).
      Le permitirá ver la información que el servidor envíe,
      enviar información al servidor y hacer algunas operaciones
      especiales comenzando con el carácter '~'. Por ejemplo terminar
      la sesión con '~.', enviar un archivo con '~p' o recibir un
      archivo con '~g'.
    </P
><P
>Dado que puede haber inconvenientes enviando o recibiendo
      archivos de 8 bits, los archivos (especialmente binarios) que envíe 
      o reciba con <B
CLASS="command"
>tip</B
> debe codificarlos antes con 
      <B
CLASS="command"
>uuencode</B
> y decodificarlos después de transmitidos
      con <B
CLASS="command"
>uudecode</B
>.  Para codificar un archivo
      <TT
CLASS="filename"
>prog.tgz</TT
> y dejarlo codificado en
      <TT
CLASS="filename"
>prog.tgz.uue</TT
>:
      <PRE
CLASS="screen"
>&#13;uuencode prog.tgz &#60; prog.tgz &#62; prog.tgz.uue</PRE
>
      posteriormente para decodificarlo:
      <PRE
CLASS="screen"
>&#13;uudecode prog.tgz.uue
      </PRE
>
    </P
><P
>El inconveniente del método descrito es que <B
CLASS="command"
>tip</B
>
      no verifica la información transmitida. Una alternativa es
      emplear un protocolo como Zmodem.  Para eso instale tanto en cliente
      como en servidor el paquete <TT
CLASS="literal"
>zmtx-zmrx</TT
>
      (o <TT
CLASS="literal"
>lrzsz</TT
>).  Cuando desee transmitir
      un archivo del servidor al cliente, inicie la transmisión
      en el servidor: <PRE
CLASS="screen"
>&#13;zmtx Mattich2.pdf
      </PRE
>
      y en el cliente desde <B
CLASS="command"
>tip</B
> use
      <TT
CLASS="literal"
>~C zmrx</TT
>.  Para enviar un archivo del cliente
      al servidor ejecute en el servidor:  <B
CLASS="command"
>zmrx</B
> y
      después desde <B
CLASS="command"
>tip</B
> use:
      <TT
CLASS="literal"
>~C zmtx miarchivo.txt</TT
>
    </P
></DIV
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="ppp-sobre-modem-nulo"
>PPP sobre Módem Nulo</A
></H2
><P
>Una vez esté conectado un cliente con un servidor OpenBSD,
	    es posible emplear el protocolo PPP<A
NAME="AEN450"
HREF="#FTN.AEN450"
><SPAN
CLASS="footnote"
>[3]</SPAN
></A
> 
	    para permitirle al computador
      cliente acceder a Internet o a la red a la que esté conectado
      el servidor.
    </P
><P
>Una forma posible para lograr conectividad a Internet en una
	    Intranet es asignando una dirección
      estática de la red al cliente y empleando el servidor para
      que actúe como proxy a nivel ARP.</P
><P
>En el servidor asegúrese de tener en el archivo
	<TT
CLASS="filename"
>/etc/ppp/ppp.conf</TT
>:

      <PRE
CLASS="screen"
>&#13;default:
  set log Phase Chat LCP IPCP CCP tun command
  set device /dev/cua00
  set speed 115200
  set ctsrts on
  set dial ""

modemnulo:
  set timeout 0
  set lqrperiod 10
  enable proxy
  enable lqr
  accept lqr
  allow users SuLogin
       </PRE
>

       Remplazando <TT
CLASS="literal"
>SuLogin</TT
>, <TT
CLASS="literal"
>SuClave</TT
>
       y las direcciones de red por las apropiadas.
       Por su parte el archivo <TT
CLASS="filename"
>/etc/ppp/ppp.conf</TT
>
       del cliente debe contener:
       <PRE
CLASS="screen"
>&#13;default:
 set log Phase Chat LCP IPCP CCP tun command
 set device /dev/cua00
 set speed 115200
 set ctsrts on
 set dial ""

modemnulo:
  set dial ""
  set authkey SuClave
  set login "TIMEOUT 3 ogin:-\\r-login: SuLogin word: \\P $ ppp\\s\\-direct\\smodemnulo\\r"
  set lqrperiod 10
  set timeout 0
  set ifaddr 192.168.16.20 192.168.16.131
  add default HISADDR
  enable lqr
  accept lqr
  enable dns
       </PRE
>

       Después pude iniciar la comunicación desde el cliente con:
       <PRE
CLASS="screen"
>&#13;ppp -ddial modemnulo
       </PRE
>

     </P
></DIV
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="referencias-modem-nulo"
>Referencias y lecturas recomendadas</A
></H2
><P
>&#13;      Puede consultar más sobre la conexión física de un módem nulo
      en [<SPAN
CLASS="citation"
><A
HREF="b2933.htm#CablesModemNulo"
>CablesModemNulo</A
></SPAN
>].
      Puede consultar sobre comunicaciones seriales en FreeBSD (similar
      a OpenBSD) en el capítulo "Serial Communications" de
      [<SPAN
CLASS="citation"
><A
HREF="b2933.htm#FreeBSDHandbook"
>FreeBSDHandbook</A
></SPAN
>]
      Para emplear un sistema OpenBSD mínimo como consola de algunos
      eventos de un servidor OpenBSD puede consultar 
      [<SPAN
CLASS="citation"
><A
HREF="b2933.htm#SerialOpenBSD"
>SerialOpenBSD</A
></SPAN
>].
      La configuración del servidor OpenBSD que le permite atender
      conexiones por el puerto serial puede verse en las siguientes
      páginas man:
      <SPAN
CLASS="citerefentry"
><SPAN
CLASS="refentrytitle"
>init</SPAN
>(8)</SPAN
>,
      <SPAN
CLASS="citerefentry"
><SPAN
CLASS="refentrytitle"
>ttys</SPAN
>(5)</SPAN
> y
      <SPAN
CLASS="citerefentry"
><SPAN
CLASS="refentrytitle"
>getty</SPAN
>(8)</SPAN
>.
      La configuración de un cliente OpenBSD para funcionar como
      consola puede consultarse en:
      <SPAN
CLASS="citerefentry"
><SPAN
CLASS="refentrytitle"
>tip</SPAN
>(1)</SPAN
> y
      <SPAN
CLASS="citerefentry"
><SPAN
CLASS="refentrytitle"
>remote</SPAN
>(5)</SPAN
>.
      Para conocer más sobre PPP puede consultarse
      el <A
HREF="ftp://ftp.rfc-editor.org/in-notes/rfc1661.txt"
TARGET="_top"
>RFC
	1661</A
>, la implementación particular de el protocolo
      de usuario en OpenBSD en la página del manual.  El archivo
      de configuración por defecto también cuenta con comentarios
      que ayudan.
    </P
></DIV
></DIV
></DIV
><H3
CLASS="FOOTNOTES"
>Notas</H3
><TABLE
BORDER="0"
CLASS="FOOTNOTES"
WIDTH="100%"
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN405"
HREF="c354.htm#AEN405"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>Como parámetro getty recibe
	  características de la línea que deben estar especificadas en
	  <TT
CLASS="filename"
>/etc/gettytab</TT
>.  En este caso
	  <TT
CLASS="literal"
>std.9600</TT
> especifica la velocidad de
	  transmisión. Empleando un módem nulo con control de flujo es 
	  posible emplear velocidades mayores hasta
	  <TT
CLASS="literal"
>std.115200</TT
>.
      </P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN413"
HREF="c354.htm#AEN413"
><SPAN
CLASS="footnote"
>[2]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>banderas del inglés <SPAN
CLASS="emphasis"
><I
CLASS="emphasis"
>flags</I
></SPAN
>
      </P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN450"
HREF="c354.htm#AEN450"
><SPAN
CLASS="footnote"
>[3]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>PPP es un protocolo especificado en el RFC 1661.</P
></TD
></TR
></TABLE
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="x327.htm"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="book1.htm"
ACCESSKEY="H"
>Inicio</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="x486.htm"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Lecturas recomendadas</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Conexión a Internet con un módem o módem ISDN</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>